#### DesignToFabricationConverter Members

---

|  |
| --- |
| DesignToFabricationConverter Class   Constructors   Methods   Properties   See Also |

The  DesignToFabricationConverter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DesignToFabricationConverter | Creates a new instance of the DesignToFabricationConverter class. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Convert | Converts the set of MEP design elements into fabrication parts. |
| Public method | Dispose | Releases all resources used by the  DesignToFabricationConverter |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetConvertedFabricationParts | Gets the set of element identifiers for newly created fabrication parts. |
| Public method | GetConvertedFabricationPartsWithInvalidConnections | Gets the collection of converted fabrication parts with invalid connections. |
| Public method | GetDesignElementAndFabricationPartsWithDifferentOffsets | Gets the collection of design elements that failed to convert and the associated set of fabrication parts with different offsets. |
| Public method | GetDesignElementAndFabricationPartsWithOpenConnectors | Gets the collection of design elements that failed to convert and the associated set of fabrication parts with open connectors. |
| Public method | GetElementsWithOpenConnector | Gets the set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetPartialConvertFailureResults | Gets the partial failure results. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetMapForFamilySymbolToFabricationPartType | Set a map for the conversion of in line family symbols to similar fabrication part types. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DesignToFabricationConverter Class

Autodesk.Revit.DB.Fabrication Namespace